# Numpy

## comparisons

In [1]:
import numpy as np

In [12]:
a = np.arange(10)
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

### np.any, np.all

In [9]:
# 하나라도 조건에 만족한다면 true
np.any(a>5), np.any(a<0)

(True, False)

In [13]:
np.any(a==5), np.any(a==12)

(True, False)

In [14]:
# 모두가 조건에 만족한다면 true
np.all(a>0), np.all(a<10)

(False, True)

### 논리연산

In [16]:
# logical_and
a = np.array([1, 3, 0], float)
np.logical_and(a>0, a<3)

array([ True, False, False])

In [17]:
# logical
b = np.array([True, False, True], bool)
np.logical_not(b)

array([False,  True, False])

In [18]:
c = np.array([False, True, False], bool)
np.logical_or(b,c)

array([ True,  True,  True])

In [23]:
# ndarray 논리 연산
x1 = np.array([
    [1, 0, 1],
    [0, 1, 1]
], bool)
x1

array([[ True, False,  True],
       [False,  True,  True]])

In [27]:
x2 = np.array([
    [1, 1, 1],
    [0, 1, 0]
])
x2

array([[1, 1, 1],
       [0, 1, 0]])

In [30]:
print(np.logical_and(x1, x2))
print(np.logical_and(x1, x2) * x2)

[[ True False  True]
 [False  True False]]
[[1 0 1]
 [0 1 0]]

### np.where

In [62]:
a = np.array([3, 0, 4, 5, 0])
np.where(a>0, 3, 2) # where(condition, True ,False)

array([3, 2, 3, 3, 2])

In [36]:
a = np.array([1, np.NaN, np.Inf, np.NaN, np.Inf], float)
np.isnan(a)

array([False,  True, False,  True, False])

In [38]:
print(np.isfinite(a))

[ True False False False False]

### argmax, argmin

In [39]:
a = np.array([1, 3, 4, 5, 6,32, 4, 5, 5, 6])

In [40]:
np.argmax(a), np.argmin(a)

(5, 0)

In [41]:
a = np.array([[1, 3, 4, 5], 
              [9, 89, 8, 3], 
              [45, 5, 6, 7]
             ])
np.argmax(a, axis=1), np.argmax(a, axis=0)

(array([3, 1, 0]), array([2, 1, 1, 2]))

## fancy indexing

In [42]:
# matrix 형태의 데이터도 가능

In [43]:
a = np.array([[1,3], [4,5]], float)
b = np.array([0, 0, 1, 1, 0], int)
c = np.array([0, 1, 0, 1, 1], int)

a[b,c]

array([1., 3., 4., 5., 3.])

In [45]:
### 번외
a.flatten()

array([1., 3., 4., 5.])

## Problem

###

- 함수목적

shape이 지정된 크기의 ndarray를 생성, 이때 행렬의 element는 type에 따라 0, 1 또는 empty로 생성됨.

- Args

shape: 생성할려는 ndarray의 shape

type: 생성되는 element들의 값을 지정함0은 0, 1은 1, 99는 empty 타입으로 생성됨

dtype: 생성하려는 ndarray의 data type (np.int)

- Returns

shape의 크기로 생성된 ndarray로 type에 따라 element의 내용이 변경됨

In [56]:
def zero_or_one_or_empty_ndarray(shape, type=0, dtype=np.int64):
    pass

###

-함수목적

입력된 vector type의 ndarray X에서 target_value와 가장 차이가 작게나는 element를 찾아 리턴함

이때 X를 list로 변경하여 처리하는 것은 실패로 간주함.

-Args

X: 입력하는 vector type의 ndarray

target_value : 가장 유사한 값의 기준값이 되는 값

-Returns

target_value와 가장 유사한 값

In [57]:
def find_nearest_value(X, target_value):
    pass

.
.

.
.
.

.
.
.
.
.
.
.
.

..

.
.
.
.

...
.
.
.

..
.
.

.
.


.
.
.
.
.
.
.


.
.



.
..

In [ ]:
def zero_or_one_or_empty_ndarray(shape, type=0, dtype=np.int64):
    if type == 0 :
        return np.zeros(shape = shape, dtype = dtype)
    if type == 1 :
        return np.ones(shape = shape, dtype = dtype)
    if type == 99 :
        return np.empty(shape = shape, dtype = dtype)

In [ ]:
zero_or_one_or_empty_ndarray((3,4), 99)

In [70]:
def find_nearest_value(X, target_value):
    return X[np.argmin(np.abs(X-target_value))]

In [71]:
X = np.random.uniform(0, 1, 100)
find_nearest_value(X, 0.3)

0.3042867990318574

# Pandas

## Air-passengers

https://www.kaggle.com/rakannimer/air-passengers

1) 승객들의 누적 합, 누적 최댓값, 누적 최솟값
2) Month 열을 year과 month로 쪼갬.
3) 승객들의 저번달 대비 증가율을 pct라는 열로 표현.

In [78]:
import pandas as pd

In [79]:
df_time_series = pd.read_csv("/Users/geumjong-yeon/Desktop/YbigtaSession/AirPassengers.csv")
df_time_series.head()

     Month  #Passengers
0  1949-01          112
1  1949-02          118
2  1949-03          132
3  1949-04          129
4  1949-05          121

In [80]:
df_time_series['step'] = range(len(df_time_series))
df_time_series.head()

     Month  #Passengers  step
0  1949-01          112     0
1  1949-02          118     1
2  1949-03          132     2
3  1949-04          129     3
4  1949-05          121     4

In [81]:
df_time_series["cum_sum"] = df_time_series["#Passengers"].cumsum()
df_time_series["cum_max"] = df_time_series["#Passengers"].cummax()
df_time_series["cum_min"] = df_time_series["#Passengers"].cummin()
df_time_series.head()

     Month  #Passengers  step  cum_sum  cum_max  cum_min
0  1949-01          112     0      112      112      112
1  1949-02          118     1      230      118      112
2  1949-03          132     2      362      132      112
3  1949-04          129     3      491      132      112
4  1949-05          121     4      612      132      112

In [86]:
import numpy as np
temp_date = df_time_series["Month"].map(lambda x : x.split("-"))
temp_date = np.array(temp_date.values.tolist())
print(temp_date[:5])

[['1949' '01']
 ['1949' '02']
 ['1949' '03']
 ['1949' '04']
 ['1949' '05']]

In [88]:
df_time_series["year"] = temp_date[:, 0] # 첫번째 열
df_time_series["month"] = temp_date[:, 1] # 두번째 열

In [90]:
df_time_series.head()

     Month  #Passengers  step  cum_sum  cum_max  cum_min  year month
0  1949-01          112     0      112      112      112  1949    01
1  1949-02          118     1      230      118      112  1949    02
2  1949-03          132     2      362      132      112  1949    03
3  1949-04          129     3      491      132      112  1949    04
4  1949-05          121     4      612      132      112  1949    05

In [91]:
df_time_series["diff"] = df_time_series["#Passengers"].diff().fillna(0)
df_time_series[:5]

     Month  #Passengers  step  cum_sum  cum_max  cum_min  year month  diff
0  1949-01          112     0      112      112      112  1949    01   0.0
1  1949-02          118     1      230      118      112  1949    02   6.0
2  1949-03          132     2      362      132      112  1949    03  14.0
3  1949-04          129     3      491      132      112  1949    04  -3.0
4  1949-05          121     4      612      132      112  1949    05  -8.0

In [98]:
df_time_series["pct"]= df_time_series["#Passengers"].pct_change().map(lambda x: "{:.2f}".format(x * 100))

In [99]:
df_time_series.head()

,Month,#Passengers,step,cum_sum,cum_max,cum_min,year,month,diff,pct
0,1949-01,112,0,112,112,112,1949,01,0.0,nan
1,1949-02,118,1,230,118,112,1949,02,6.0,5.36
2,1949-03,132,2,362,132,112,1949,03,14.0,11.86
3,1949-04,129,3,491,132,112,1949,04,-3.0,-2.27
4,1949-05,121,4,612,132,112,1949,05,-8.0,-6.20

In [100]:
df_time_series = df_time_series.drop('Month', axis=1)

In [101]:
df_time_series.head()

   #Passengers  step  cum_sum  cum_max  cum_min  year month  diff    pct
0          112     0      112      112      112  1949    01   0.0    nan
1          118     1      230      118      112  1949    02   6.0   5.36
2          132     2      362      132      112  1949    03  14.0  11.86
3          129     3      491      132      112  1949    04  -3.0  -2.27
4          121     4      612      132      112  1949    05  -8.0  -6.20

## 채무불이행률

In [104]:
train_data = pd.read_csv('/Users/geumjong-yeon/Desktop/21-2/투자공학/2차 과제 - 채무불이행 분류 예측 모델/data/test/loan_test.csv')
train_data.head()

,id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,emp_title,...,revol_util,total_acc,initial_list_status,out_prncp,out_prncp_inv,recoveries,collection_recovery_fee,policy_code,tot_cur_bal,total_rev_hi_lim
0,16001,2400,2400,2400.000000,36 months,13.67,81.65,B,B5,Chase,...,87.9,34,f,0.0,0.0,0.0,0.0,1,NaN,NaN
1,16002,20000,20000,20000.000000,60 months,19.52,524.56,E,E2,Production manager,...,68.2,43,w,0.0,0.0,0.0,0.0,1,258440.0,53500.0
2,16003,10625,10625,10625.000000,36 months,15.31,369.94,C,C2,smithfield packing co.,...,82.8,15,f,0.0,0.0,0.0,0.0,1,63443.0,15100.0
3,16004,16800,16800,16800.000000,36 months,7.90,525.68,A,A4,L.A.co. Sheriff's Dept,...,59.8,17,f,0.0,0.0,0.0,0.0,1,322284.0,20400.0
4,16005,10000,10000,9831.692001,60 months,13.98,232.58,C,C3,Military,...,29.7,30,f,0.0,0.0,0.0,0.0,1,NaN,NaN

In [105]:
train_copy = train_data.drop('id', axis = 1)

In [106]:
train_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 33 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   loan_amnt                4000 non-null   int64
 1   funded_amnt              4000 non-null   int64
 2   funded_amnt_inv          4000 non-null   float64
 3   term                     4000 non-null   object
 4   int_rate                 4000 non-null   float64
 5   installment              4000 non-null   float64
 6   grade                    4000 non-null   object
 7   sub_grade                4000 non-null   object
 8   emp_title                3734 non-null   object
 9   emp_length               3779 non-null   object
 10  home_ownership           4000 non-null   object
 11  annual_inc               4000 non-null   float64
 12  pymnt_plan               4000 non-null   object
 13  purpose                  4000 non-null   object
 14  title                    4000 non-null   object
 15  addr_state               4000 non-null   object
 16  dti                      4000 non-null   float64
 17  delinq_2yrs              4000 non-null   int64
 18  earliest_cr_line         4000 non-null   object
 19  inq_last_6mths           4000 non-null   int64
 20  open_acc                 4000 non-null   int64
 21  pub_rec                  4000 non-null   int64
 22  revol_bal                4000 non-null   int64
 23  revol_util               3993 non-null   float64
 24  total_acc                4000 non-null   int64
 25  initial_list_status      4000 non-null   object
 26  out_prncp                4000 non-null   float64
 27  out_prncp_inv            4000 non-null   float64
 28  recoveries               4000 non-null   float64
 29  collection_recovery_fee  4000 non-null   float64
 30  policy_code              4000 non-null   int64
 31  tot_cur_bal              3518 non-null   float64
 32  total_rev_hi_lim         3518 non-null   float64
dtypes: float64(12), int64(9), object(12)
memory usage: 1.0+ MB

In [107]:
train_copy.describe()

,loan_amnt,funded_amnt,funded_amnt_inv,int_rate,installment,annual_inc,dti,delinq_2yrs,inq_last_6mths,open_acc,...,revol_bal,revol_util,total_acc,out_prncp,out_prncp_inv,recoveries,collection_recovery_fee,policy_code,tot_cur_bal,total_rev_hi_lim
count,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,...,4000.000000,3993.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.0,3.518000e+03,3518.000000
mean,14542.250000,14524.925000,14468.082643,14.635832,436.286335,70040.830420,18.308027,0.309750,0.812750,11.330750,...,15237.971000,56.637941,25.059250,5916.976748,5914.482365,211.828421,22.993468,1.0,1.243636e+05,28575.843093
std,8315.447318,8301.721807,8313.120679,4.499255,243.450638,46154.988393,8.286838,0.855563,1.029783,5.331975,...,15826.202291,24.380489,12.020144,8109.587647,8106.108980,932.979801,168.642119,0.0,1.372976e+05,28970.110097
min,1000.000000,1000.000000,0.000000,5.320000,28.820000,8000.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,3.000000,0.000000,0.000000,0.000000,0.000000,1.0,0.000000e+00,0.000000
25%,8000.000000,8000.000000,8000.000000,11.530000,266.180000,43114.750000,12.157500,0.000000,0.000000,8.000000,...,6109.250000,39.400000,16.000000,0.000000,0.000000,0.000000,0.000000,1.0,2.731225e+04,12970.750000
50%,12500.000000,12500.000000,12400.000000,14.310000,381.375000,60000.000000,18.050000,0.000000,0.000000,10.000000,...,11417.500000,58.200000,23.000000,0.000000,0.000000,0.000000,0.000000,1.0,6.636550e+04,21600.000000
75%,20000.000000,20000.000000,20000.000000,17.570000,562.130000,83850.000000,24.082500,0.000000,1.000000,14.000000,...,19147.000000,75.700000,32.000000,10470.562500,10470.562500,0.000000,0.000000,1.0,1.876768e+05,35300.000000
max,35000.000000,35000.000000,35000.000000,28.990000,1374.630000,800000.000000,39.830000,10.000000,6.000000,90.000000,...,266850.000000,111.000000,107.000000,35000.000000,34925.000000,31900.520000,5694.093600,1.0,1.647506e+06,861100.000000

In [109]:
train_copy['mean_amnt'] = train_copy[['loan_amnt','funded_amnt','funded_amnt_inv']].mean(axis = 1)
train_copy = train_copy.drop(['loan_amnt','funded_amnt','funded_amnt_inv'], axis = 1 )

In [110]:
train_copy

,term,int_rate,installment,grade,sub_grade,emp_title,emp_length,home_ownership,annual_inc,pymnt_plan,...,total_acc,initial_list_status,out_prncp,out_prncp_inv,recoveries,collection_recovery_fee,policy_code,tot_cur_bal,total_rev_hi_lim,mean_amnt
0,36 months,13.67,81.65,B,B5,Chase,6 years,MORTGAGE,85000.0,n,...,34,f,0.00,0.00,0.0,0.0,1,NaN,NaN,2400.000000
1,60 months,19.52,524.56,E,E2,Production manager,10+ years,MORTGAGE,74000.0,n,...,43,w,0.00,0.00,0.0,0.0,1,258440.0,53500.0,20000.000000
2,36 months,15.31,369.94,C,C2,smithfield packing co.,10+ years,MORTGAGE,30404.0,n,...,15,f,0.00,0.00,0.0,0.0,1,63443.0,15100.0,10625.000000
3,36 months,7.90,525.68,A,A4,L.A.co. Sheriff's Dept,5 years,MORTGAGE,80000.0,n,...,17,f,0.00,0.00,0.0,0.0,1,322284.0,20400.0,16800.000000
4,60 months,13.98,232.58,C,C3,Military,8 years,MORTGAGE,60000.0,n,...,30,f,0.00,0.00,0.0,0.0,1,NaN,NaN,9943.897334
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3995,60 months,18.54,269.73,E,E1,material handler,7 years,RENT,33000.0,n,...,16,w,9094.47,9094.47,0.0,0.0,1,38056.0,23600.0,10500.000000
3996,60 months,16.29,489.45,D,D2,Nurse practitioner,1 year,RENT,100000.0,n,...,45,f,15863.81,15863.81,0.0,0.0,1,328997.0,6200.0,20000.000000
3997,36 months,7.89,312.86,A,A5,City driver,5 years,RENT,70000.0,n,...,17,w,7716.61,7716.61,0.0,0.0,1,31920.0,13500.0,10000.000000
3998,36 months,8.39,1103.09,A,A5,Director of Operations,2 years,MORTGAGE,85000.0,n,...,26,f,0.00,0.00,0.0,0.0,1,16476.0,47100.0,35000.000000
3999,36 months,7.90,563.23,A,A4,Express Technology Inc.,10+ years,MORTGAGE,68000.0,n,...,24,f,0.00,0.00,0.0,0.0,1,NaN,NaN,18000.000000

In [112]:
train_copy[['tot_cur_bal', 'revol_util']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   tot_cur_bal  3518 non-null   float64
 1   revol_util   3993 non-null   float64
dtypes: float64(2)
memory usage: 62.6 KB

In [114]:
train_copy['tot_cur_bal'].fillna(train_copy['tot_cur_bal'].mean(), inplace = True)
train_copy['revol_util'].fillna(train_copy['revol_util'].mean(), inplace = True)

## 번외

In [19]:
# 문제 이해
# 왓차 추천 문제
df = pd.DataFrame({'name' : ['종연', '유찬', '은학', '성수'],
                   'MV1'  : [5, 6, 7, np.nan],
                   'MV2'  : [6, np.nan, 8, 9],
                   'MV3'  : [np.nan, 6, 7, 8]})
df.set_index('name', inplace = True)
df

      MV1  MV2  MV3
name
종연    5.0  6.0  NaN
유찬    6.0  NaN  6.0
은학    7.0  8.0  7.0
성수    NaN  9.0  8.0

In [20]:
print(df.stack())
print(type(df.stack()))
print('\n')
print(df.stack().unstack())

name
종연    MV1    5.0
      MV2    6.0
유찬    MV1    6.0
      MV3    6.0
은학    MV1    7.0
      MV2    8.0
      MV3    7.0
성수    MV2    9.0
      MV3    8.0
dtype: float64
<class 'pandas.core.series.Series'>


      MV1  MV2  MV3
name
종연    5.0  6.0  NaN
유찬    6.0  NaN  6.0
은학    7.0  8.0  7.0
성수    NaN  9.0  8.0

In [1]:
import numpy as np
import pandas as pd

In [27]:
df = pd.read_csv('/Users/geumjong-yeon/Downloads/3_lab_bulid_matrix/movie_rating.csv')
df.head(20)

           source              target  rating
0   Jack Matthews   Lady in the Water     3.0
1   Jack Matthews   Snakes on a Plane     4.0
2   Jack Matthews   You Me and Dupree     3.5
3   Jack Matthews    Superman Returns     5.0
4   Jack Matthews  The Night Listener     3.0
5    Mick LaSalle   Lady in the Water     3.0
6    Mick LaSalle   Snakes on a Plane     4.0
7    Mick LaSalle        Just My Luck     2.0
8    Mick LaSalle    Superman Returns     3.0
9    Mick LaSalle  The Night Listener     3.0
10   Claudia Puig   Snakes on a Plane     3.5
11   Claudia Puig        Just My Luck     3.0
12   Claudia Puig  The Night Listener     4.5
13      Lisa Rose   Lady in the Water     2.5
14      Lisa Rose   Snakes on a Plane     3.5
15      Lisa Rose        Just My Luck     3.0
16      Lisa Rose    Superman Returns     3.5
17      Lisa Rose  The Night Listener     3.0
18      Lisa Rose   You Me and Dupree     2.5
19           Toby   Snakes on a Plane     4.5

In [31]:
df.groupby(['source', 'target'])['rating'].sum()

source         target
Claudia Puig   Just My Luck          3.0
               Snakes on a Plane     3.5
               The Night Listener    4.5
Gene Seymour   Lady in the Water     3.0
               Snakes on a Plane     3.5
               The Night Listener    3.0
               You Me and Dupree     3.5
Jack Matthews  Lady in the Water     3.0
               Snakes on a Plane     4.0
               Superman Returns      5.0
               The Night Listener    3.0
               You Me and Dupree     3.5
Lisa Rose      Just My Luck          3.0
               Lady in the Water     2.5
               Snakes on a Plane     3.5
               Superman Returns      3.5
               The Night Listener    3.0
               You Me and Dupree     2.5
Mick LaSalle   Just My Luck          2.0
               Lady in the Water     3.0
               Snakes on a Plane     4.0
               Superman Returns      3.0
               The Night Listener    3.0
Toby           Snakes on a Plane     4.5
               Superman Returns      4.0
Name: rating, dtype: float64

In [32]:
df.groupby(['source', 'target'])['rating'].sum().unstack()

target,Just My Luck,Lady in the Water,Snakes on a Plane,Superman Returns,The Night Listener,You Me and Dupree
source,,,,,,
Claudia Puig,3.0,NaN,3.5,NaN,4.5,NaN
Gene Seymour,NaN,3.0,3.5,NaN,3.0,3.5
Jack Matthews,NaN,3.0,4.0,5.0,3.0,3.5
Lisa Rose,3.0,2.5,3.5,3.5,3.0,2.5
Mick LaSalle,2.0,3.0,4.0,3.0,3.0,NaN
Toby,NaN,NaN,4.5,4.0,NaN,NaN

In [33]:
df.groupby(['source', 'target'])['rating'].sum().unstack().fillna(0)

target,Just My Luck,Lady in the Water,Snakes on a Plane,Superman Returns,The Night Listener,You Me and Dupree
source,,,,,,
Claudia Puig,3.0,0.0,3.5,0.0,4.5,0.0
Gene Seymour,0.0,3.0,3.5,0.0,3.0,3.5
Jack Matthews,0.0,3.0,4.0,5.0,3.0,3.5
Lisa Rose,3.0,2.5,3.5,3.5,3.0,2.5
Mick LaSalle,2.0,3.0,4.0,3.0,3.0,0.0
Toby,0.0,0.0,4.5,4.0,0.0,0.0